<script setup lang="ts">
import BaseLink from '@/components/BaseLink.vue';
</script>

<template>
  <div class="about">
    <div class="about-content">
        <h2 style="margin-top: 0">Частые вопросы</h2>
        <h3>Как мне зарегистрироваться?</h3>
        <div>Регистрация в нашем сервисе проходит на <BaseLink href="https://stablehorde.net/register">Сайте</BaseLink> . После регистрации вам будет предоставлен API ключ. Не потеряйте его! Это ваша альфа и омега, логин и пароль, восстановить его мы не сможем.</div><br>
        <div>И не забудьте ввести полученный вами ключ в разделе настроек!</div>
        <h3>Мне нужны какие-то очки для создания картинок. Где их получать?</h3>
        <div>Очки в нашем сервисе служат подтверждением вашего вклада в производительность сервиса. Есть 3 способа получать очки:</div><br>
        <ul>
            <li>Установить клиент-работник на свой ПК. <BaseLink href="https://github.com/db0/AI-Horde-Worker#readme">Ссылка с инструкцией</BaseLink></li>
            <li>Запустить облачный клиент на Google Colab. Это не будет использовать мощности вашего устройства и позволяет вам бесплатно стать частью сети на 3 часа в сутки. Просто заполните все поля блокнота и последовательно запустите ячейки. <BaseLink href="https://colab.research.google.com/drive/1KRUHfY8CoJeFVrfGPh-Xz4nQZe25zIbh?usp=sharing">Ссылка на блокнот</BaseLink></li>
            <li>Оценивайте изображения во вкладке Rating. Это самый простой, но при этом и самый неприбыльный способ. Перейдите во вкладку генератора и найдите иконку со звездочкой. Будте внимательны! Во вкладке действует защита от накруток в виде периодических Capthca картинок. Вы сразу сможете их отличить по читаемому тексту и большой цифре, просто выставляйте запрошенную на картинке оценку.</li>
        </ul>
        <div>Наш сервис не предоставляет никаких платных услуг! Вы не можете получить очки иными способами, кроме выполнения действий приведённых выше.</div><br>
        <h3>Мои картинки получаются какими-то очень несуразными. Как мне улучшить качество изображений?</h3>
        <ul>
            <li>Во-первых, чем больше и чётче запрос-тем лучше результат. Вместо того, чтобы просить изобразить вам "cat in a field", например, попробуйте подробнее описать кота, время суток, в поле чего он находится, уровень качества изображения, стиль и так далее чтобы получилось что-то вроде "a multi-coloured cat with blue eyes sitting on a small rock in a wheat field, noon time, outdoors, wheat field, oil painting, masterpeice, stylized clouds". Также не забудьте про отрицательный запрос! Это поможет вам искоренять различные получаемые огрехи с каждой новой картинкой.</li>
            <li>Во-вторых, попробуйте поменять сэмплер и число шагов. Чем больше шагов, тем, очевидно, лучше качество. Разные сэмплеры работают по разному, но из практики euler_a-самый быстрый и креативный, а семейство dpm и сэмплер ddim-дают более проработанные результаты за счёт времени работы.</li>
            <li>В третьих, разрешение. Если вы хотите изобразить персонажа в вертикально положении - поменяйте разрешение изображения так, чтобы по вертикали оно было длиннее, и наоборот, если вы хотите лежачего персонажа, то сделайте и изображение шире, чем оно выше.</li>>
            <li>И последнее, но далеко не по важности - подбирайте модели. Разные модели могут справляться с разными задачами лучше остальных. Зайдите во вкладку работники и модели, чтобы посмотреть какая на что способна, или наведите на значок справки в меню генератора.</li>>
        </ul>>
        <div>Если вам необходимы более наглядные примеры, пожалуйста посетите <BaseLink href="https://lexica.art/">LexicaArt</BaseLink> - крупнейший хостинг для ИИ изображений, где вы также можете посмотреть какой запрос использовался автором. Также вам может помочь <BaseLink href="https://publicprompts.art/">PublicPrompts</BaseLink> - сайт-коллекция различных типов запросов под разные стили!</div>
    </div>
  </div>
</template>

<style scoped>
h3, h1 {
    margin-bottom: 0;
}

.about {
    width: 100%;
    font-size: 1.1rem;
    display: flex;
    justify-content: center;
}

.about-content {
    width: 60%
}

.faq {
    font-size: 1.05rem
}

@media only screen and (max-width: 1000px) {
    .about-content {
        width: 80%;
    }
}

@media only screen and (max-width: 700px) {
    .about-content {
        width: 100%;
    }
}
</style>
